# Bibliotheek-uitwerkingen (1)

In [4]:
%LOAD data/bibliotheek.db

:::{solution-start} recente-schrijvers
:::

Welke schrijvers zijn geboren na 1960? Geef de voornaam, tussenvoegsel, achternaam, en geboortejaar.

In [5]:
SELECT voornaam, tussenvoegsel, achternaam, geb_jaar
FROM auteurs
WHERE geb_jaar > "1960"
ORDER BY geb_jaar;

+------------+---------------+------------------+----------+
| VOORNAAM   | TUSSENVOEGSEL | ACHTERNAAM       | GEB_JAAR |
+------------+---------------+------------------+----------+
| Manon      |               | Uphoff           | 1962     |
+------------+---------------+------------------+----------+
| Karel      |               | Glastra van Loon | 1962     |
+------------+---------------+------------------+----------+
| Joost      |               | Zwagerman        | 1963     |
+------------+---------------+------------------+----------+
| Ronald     |               | Giphart          | 1965     |
+------------+---------------+------------------+----------+
| Hafid      |               | Bouazza          | 1970     |
+------------+---------------+------------------+----------+
| Arnon      |               | Grunberg         | 1971     |
+------------+---------------+------------------+----------+
| Abdelkader |               | Benali           | 1975     |
+------------+---------------+------------------+----------+

Variatie: combineer de voornaam, achternaam en tussenvoegsel tot één naam

In [6]:
SELECT IFNULL(voornaam || ' ', '') || IFNULL(tussenvoegsel || ' ', '') || achternaam as NAAM, geb_jaar
FROM auteurs
WHERE geb_jaar > "1960"
ORDER BY geb_jaar;

+------------------------+----------+
| NAAM                   | GEB_JAAR |
+------------------------+----------+
| Manon Uphoff           | 1962     |
+------------------------+----------+
| Karel Glastra van Loon | 1962     |
+------------------------+----------+
| Joost Zwagerman        | 1963     |
+------------------------+----------+
| Ronald Giphart         | 1965     |
+------------------------+----------+
| Hafid Bouazza          | 1970     |
+------------------------+----------+
| Arnon Grunberg         | 1971     |
+------------------------+----------+
| Abdelkader Benali      | 1975     |
+------------------------+----------+

:::{solution-end}
:::

:::{solution-start} niet-nederlandse-boeken
:::

Welke boeken vallen niet in de rubriek "nederlands"? (Geef alleen de eerste 10 boeken: titel en rubriek.)

* Variatie: geef titel, schrijver em rubriek

In [14]:
SELECT titel, rubriek
FROM boeken
WHERE rubriek <> "nederlands"
ORDER BY titel
LIMIT 10;

+----------------------------+-------------+
| TITEL                      | RUBRIEK     |
+----------------------------+-------------+
| 1984                       | engels      |
+----------------------------+-------------+
| A Bend in the River        | engels      |
+----------------------------+-------------+
| A Catcher in the Rye       | engels      |
+----------------------------+-------------+
| A Christmas Carol          | engels      |
+----------------------------+-------------+
| A Prayer for Owen Meany    | engels      |
+----------------------------+-------------+
| A Son of the Circus        | engels      |
+----------------------------+-------------+
| A tale of two cities       | engels      |
+----------------------------+-------------+
| Animal Farm                | engels      |
+----------------------------+-------------+
| Computernetwerken (2e ed.) | informatica |
+----------------------------+-------------+
| Congo Journey              | engels      |
+----------------------------+-------------+

* Variatie: geef titel, auteur (als 1 string, met kolomnaam: AUTEUR) em rubriek

In [13]:
SELECT titel
     , IFNULL(voornaam || ' ', '') || IFNULL(tussenvoegsel || ' ', '') || achternaam as AUTEUR
     , rubriek
FROM boeken
     JOIN auteurs ON boeken.autnr = auteurs.auteurnr
WHERE rubriek <> "nederlands"
ORDER BY titel
LIMIT 10;

+----------------------------+-------------------------------+-------------+
| TITEL                      | AUTEUR                        | RUBRIEK     |
+----------------------------+-------------------------------+-------------+
| 1984                       | George Orwell                 | engels      |
+----------------------------+-------------------------------+-------------+
| A Bend in the River        | Vidiadhar Surajprasad Naipaul | engels      |
+----------------------------+-------------------------------+-------------+
| A Catcher in the Rye       | Salinger                      | engels      |
+----------------------------+-------------------------------+-------------+
| A Christmas Carol          | Charles Dickens               | engels      |
+----------------------------+-------------------------------+-------------+
| A Prayer for Owen Meany    | John Irving                   | engels      |
+----------------------------+-------------------------------+-------------+
| A Son of the Circus        | John Irving                   | engels      |
+----------------------------+-------------------------------+-------------+
| A tale of two cities       | Charles Dickens               | engels      |
+----------------------------+-------------------------------+-------------+
| Animal Farm                | George Orwell                 | engels      |
+----------------------------+-------------------------------+-------------+
| Computernetwerken (2e ed.) | Andrew Tanenbaum              | informatica |
+----------------------------+-------------------------------+-------------+
| Cryptografie en ICT        | Aoufi El Said                 | informatica |
+----------------------------+-------------------------------+-------------+

:::{solution-end}
:::

:::{solution-start} boeken-rubrieken
:::

In welke rubrieken worden de boeken ingedeeld? Geef deze in alfabetische volgorde.

In [16]:
SELECT DISTINCT rubriek
FROM boeken
ORDER BY rubriek;

+------------------+
| RUBRIEK          |
+------------------+
| biologie         |
+------------------+
| duits            |
+------------------+
| engels           |
+------------------+
| frans            |
+------------------+
| geschiedenis     |
+------------------+
| informatica      |
+------------------+
| maatschappijleer |
+------------------+
| natuurkunde      |
+------------------+
| nederlands       |
+------------------+
| scheikunde       |
+------------------+

:::{solution-end}
:::

:::{solution-start} boeken-gerard-reve
:::

Welke boeken van Gerard Reve zijn er in de bibliotheek? (Geef titel, jaar van publicatie, en naam van de auteur.)

In [19]:
SELECT titel
     , pub_jaar as JAAR
     , IFNULL(voornaam || ' ', '') || IFNULL(tussenvoegsel || ' ', '') || achternaam as AUTEUR
FROM boeken
     JOIN auteurs ON boeken.autnr = auteurs.auteurnr
WHERE auteurs.voornaam = "Gerard" and auteurs.achternaam = "Reve";

+-----------------------+------+-------------+
| TITEL                 | JAAR | AUTEUR      |
+-----------------------+------+-------------+
| De Avonden            | 1947 | Gerard Reve |
+-----------------------+------+-------------+
| Op weg naar het einde | 1963 | Gerard Reve |
+-----------------------+------+-------------+
| De vierde man         | 1981 | Gerard Reve |
+-----------------------+------+-------------+

:::{solution-end}
:::

:::{solution-start} leerlingen-boete
:::

Welke leerlingen hebben een boete van meer dan 3,50 Euro gehad? (Geef voornaam, tussenvoegsel, achternaam, en boete; geef alleen de eerste 10, op alfabetische volgorde van achternaam.)

In [23]:
SELECT voornaam, tussenvoegsel, achternaam, boete
FROM leerlingen
     JOIN uitleningen ON leerlingen.llnr = uitleningen.llnr
WHERE boete > 3.50
ORDER BY achternaam
LIMIT 10;

+----------+---------------+------------+-------+
| VOORNAAM | TUSSENVOEGSEL | ACHTERNAAM | BOETE |
+----------+---------------+------------+-------+
| Sahila   |               | Abdoulai   | 4.0   |
+----------+---------------+------------+-------+
| Sahila   |               | Abdoulai   | 4.0   |
+----------+---------------+------------+-------+
| Fatma    |               | Abdulkadir | 4.0   |
+----------+---------------+------------+-------+
| Glenn    |               | Baarman    | 4.0   |
+----------+---------------+------------+-------+
| John     |               | Bartemans  | 4.0   |
+----------+---------------+------------+-------+
| John     |               | Bartemans  | 4.0   |
+----------+---------------+------------+-------+
| Jan      |               | Bedeski    | 4.0   |
+----------+---------------+------------+-------+
| Jan      |               | Bedeski    | 4.0   |
+----------+---------------+------------+-------+
| Marco    | van           | Bemmel     | 3.8   |
+----------+---------------+------------+-------+
| Mandy    |               | Bielderman | 4.0   |
+----------+---------------+------------+-------+

:::{solution-end}
:::

:::{solution-start} totaal-boete
:::

Maak een top-5 van de leerlingen die *in totaal* het grootste bedrag aan boetes betaald hebben.

In [30]:
SELECT voornaam, tussenvoegsel, achternaam, sum(boete) as Totaal_boete
FROM leerlingen
     JOIN uitleningen ON leerlingen.llnr = uitleningen.llnr
GROUP BY voornaam, tussenvoegsel, achternaam
ORDER BY totaal_boete DESC
LIMIT 5;

+----------+---------------+------------+--------------+
| VOORNAAM | TUSSENVOEGSEL | ACHTERNAAM | Totaal_boete |
+----------+---------------+------------+--------------+
| Saskia   |               | Onk        | 66.2         |
+----------+---------------+------------+--------------+
| Bram     |               | Polman     | 55.4         |
+----------+---------------+------------+--------------+
| Wilma    |               | Elkema     | 37.2         |
+----------+---------------+------------+--------------+
| Fatma    |               | Abdulkadir | 31.6         |
+----------+---------------+------------+--------------+
| Mark     |               | Pullman    | 29.0         |
+----------+---------------+------------+--------------+

:::{solution-end}
:::